# 30 Days of Pandas Leetcode

# Big countries

In [20]:
import pandas as pd

data = [['Afghanistan', 'Asia', 652230, 25500100, 20343000000], ['Albania', 'Europe', 28748, 2831741, 12960000000], ['Algeria', 'Africa', 2381741, 37100000, 188681000000], ['Andorra', 'Europe', 468, 78115, 3712000000], ['Angola', 'Africa', 1246700, 20609294, 100990000000]]
world = pd.DataFrame(data, columns=['name', 'continent', 'area', 'population', 'gdp']).astype({'name':'object', 'continent':'object', 'area':'Int64', 'population':'Int64', 'gdp':'Int64'})

df = world[(world['area'] >= 3000000) | (world['population'] >= 25000000)]

df[['name', 'population', 'area']]

          name  population     area
0  Afghanistan    25500100   652230
2      Algeria    37100000  2381741

# Recyclable and low fats products

In [24]:
import pandas as pd

data = [['0', 'Y', 'N'], ['1', 'Y', 'Y'], ['2', 'N', 'Y'], ['3', 'Y', 'Y'], ['4', 'N', 'N']]
products = pd.DataFrame(data, columns=['product_id', 'low_fats', 'recyclable']).astype({'product_id':'int64', 'low_fats':'category', 'recyclable':'category'})

df = products[(products["low_fats"] == "Y") & (products["recyclable"] == "Y")]

df[['product_id']]

   product_id
1           1
3           3

 # Customers who never order

In [43]:
import pandas as pd

data = [[1, 'Joe'], [2, 'Henry'], [3, 'Sam'], [4, 'Max']]
customers = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'Int64', 'name':'object'})
data = [[1, 3], [2, 1]]
orders = pd.DataFrame(data, columns=['id', 'customerId']).astype({'id':'Int64', 'customerId':'Int64'})

df = customers[~(customers['id'].isin(orders['customerId']))]

df[["name"]].rename(columns={"name": "Customers"})

  Customers
1     Henry
3       Max

# Article views I

In [63]:
import pandas as pd

data = [[1, 3, 5, '2019-08-01'], [1, 3, 6, '2019-08-02'], [2, 7, 7, '2019-08-01'], [2, 7, 6, '2019-08-02'], [4, 7, 1, '2019-07-22'], [3, 4, 4, '2019-07-21'], [3, 4, 4, '2019-07-21']]
views = pd.DataFrame(data, columns=['article_id', 'author_id', 'viewer_id', 'view_date']).astype({'article_id':'Int64', 'author_id':'Int64', 'viewer_id':'Int64', 'view_date':'datetime64[ns]'})

# Filter rows where "author_id" == "viewer_id"
df = views[(views["author_id"] == views["viewer_id"])]
df = df.drop_duplicates(subset=["author_id"])
df = df.sort_values(by=["author_id"])
df = df.rename(columns={"author_id": "id"})
df

   article_id  id  viewer_id  view_date
5           3   4          4 2019-07-21
2           2   7          7 2019-08-01

# Invalid tweets

In [76]:
import pandas as pd

data = [[1, 'Vote for Biden'], [2, 'Let us make America great again!']]
tweets = pd.DataFrame(data, columns=['tweet_id', 'content']).astype({'tweet_id':'Int64', 'content':'object'})

# Filter rows where the length of "content" is strictly greater than 15
invalid_tweets = tweets[(tweets["content"].str.len() > 15)]

# Return "tweet_id" of invalid tweets
result_df = invalid_tweets[["tweet_id"]]

result_df

   tweet_id
1         2

# Calculate special bonus

In [78]:
import pandas as pd

data = [[2, 'Meir', 3000], [3, 'Michael', 3800], [9, 'Addilyn', 7400], [8, 'Juan', 6100], [7, 'Kannon', 7700]]
employees = pd.DataFrame(data, columns=['employee_id', 'name', 'salary']).astype({'employee_id':'int64', 'name':'object', 'salary':'int64'})

# Create new column "bonus" with default value = 0
employees["bonus"] = 0

# Set bonus for appropriate employee equal to their salary
employees.loc[(employees["employee_id"] % 2 == 1) & (employees["name"].str[0] != "M"), "bonus"] = employees["salary"]

# Return result 
result_df = employees[["employee_id", "bonus"]].sort_values(by=["employee_id"])

result_df

   employee_id  bonus
0            2      0
1            3      0
4            7   7700
3            8      0
2            9   7400

# Fix names in a table

In [104]:
import pandas as pd 

data = [[1, 'aLice'], [2, 'bOB']]
users = pd.DataFrame(data, columns=['user_id', 'name']).astype({'user_id':'Int64', 'name':'object'})

users["name"] = users["name"].str.title()

# Return result
result_df = users.sort_values(by=["user_id"])

result_df

   user_id   name
0        1  Alice
1        2    Bob

# Find users with valid e-mails

In [106]:
import pandas as pd

data = [[1, 'Winston', 'winston@leetcode.com'], [2, 'Jonathan', 'jonathanisgreat'], [3, 'Annabelle', 'bella-@leetcode.com'], [4, 'Sally', 'sally.come2@leetcode.com'], [5, 'Marwan', 'quarz#2020@leetcode.com'], [6, 'David', 'david69@gmail.com'], [7, 'Shapiro', '.shapo@leetcode.com']]
users = pd.DataFrame(data, columns=['user_id', 'name', 'mail']).astype({'user_id':'int64', 'name':'object', 'mail':'object'})

users[users["mail"].str.match(r"^[A-Za-z][A-Za-z0-9_\.\-]*@leetcode\.com$")]

   user_id       name                      mail
0        1    Winston      winston@leetcode.com
2        3  Annabelle       bella-@leetcode.com
3        4      Sally  sally.come2@leetcode.com

# Patients with a condition

In [110]:
import pandas as pd

data = [[1, 'Daniel', 'YFEV COUGH'], [2, 'Alice', ''], [3, 'Bob', 'DIAB100 MYOP'], [4, 'George', 'ACNE DIAB100'], [5, 'Alain', 'DIAB201']]
patients = pd.DataFrame(data, columns=['patient_id', 'patient_name', 'conditions']).astype({'patient_id':'int64', 'patient_name':'object', 'conditions':'object'})

# \b is a word boundary assertion to ensure that "DIAB1" is a separate word and not part of another word
patients[patients["conditions"].str.contains(r"\bDIAB1")]

   patient_id patient_name    conditions
2           3          Bob  DIAB100 MYOP
3           4       George  ACNE DIAB100

# Nth highest salary

In [158]:
import pandas as pd

data = [[1, 100], [2, 200], [3, 300]]
employee = pd.DataFrame(data, columns=['id', 'salary']).astype({'id':'int64', 'salary':'int64'})
n = int(input())

# ------------------------------------------ Self-done ---------------------------------------------
column_name = "getNthHighestSalary(" + str(n) + ")"

# salary_list = sorted(list(set(employee["salary"])), reverse=True)

# temp = None
# if len(salary_list) >= n:
#     temp = salary_list[n - 1]
    
# data = [[temp]]
# result_df = pd.DataFrame(data, columns=[column_name]).astype({column_name:"object"})

# result_df

# ------------------------------------------ Solution --------------------------------------------
unique_salary = employee["salary"].drop_duplicates()

sorted_salary = unique_salary.sort_values(ascending=False)

if n > len(sorted_salary):
    result_df = pd.DataFrame({column_name: [None]})
else:
    result_df = pd.DataFrame({column_name: [sorted_salary.iloc[n - 1]]})
    
result_df

3

   getNthHighestSalary(3)
0                     100

# Second highest salary

In [159]:
import pandas as pd

data = [[1, 100], [2, 200], [3, 300]]
employee = pd.DataFrame(data, columns=['id', 'salary']).astype({'id':'int64', 'salary':'int64'})

unique_salary = employee["salary"].drop_duplicates()

sorted_salary = unique_salary.sort_values(ascending=False)

if len(sorted_salary) < 2: 
    result_df = pd.DataFrame({"SecondHighestSalary": [None]})
else:
    result_df = pd.DataFrame({"SecondHighestSalary": [sorted_salary.iloc[1]]})

result_df

   SecondHighestSalary
0                  200

# Department highest salary

In [189]:
import pandas as pd

data = [[1, 'Joe', 70000, 1], [2, 'Jim', 90000, 1], [3, 'Henry', 80000, 2], [4, 'Sam', 60000, 2], [5, 'Max', 90000, 1]]
employee = pd.DataFrame(data, columns=['id', 'name', 'salary', 'departmentId']).astype({'id':'Int64', 'name':'object', 'salary':'Int64', 'departmentId':'Int64'})
data = [[1, 'IT'], [2, 'Sales']]
department = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'Int64', 'name':'object'})

# Check if dataframe is empty
# if employee.empty or department.empty:
#     return pd.DataFrame(columns=["Department", "Employee", "Salary"])

# Merge 2 dataframes
merge_df = employee.merge(department, left_on="departmentId", right_on="id", suffixes=("_employee", "_department"))

# Find highest salary employee in each department
highest_salary_df = merge_df.groupby("departmentId").apply(lambda x: x[x["salary"] == x["salary"].max()])

# Remove the "groupby" group labels
result_df = highest_salary_df[["name_department", "name_employee", "salary"]].reset_index(drop=True)

# Change columns' names
result_df.columns = ["Department", "Employee", "Salary"]

result_df

  Department Employee  Salary
0         IT      Jim   90000
1         IT      Max   90000
2      Sales    Henry   80000

# Delete duplicate emails

In [196]:
import pandas as pd

data = [[1, 'john@example.com'], [2, 'bob@example.com'], [3, 'john@example.com']]
person = pd.DataFrame(data, columns=['id', 'email']).astype({'id':'int64', 'email':'object'})

person.sort_values(by=["id"], ascending=True, inplace=True)
person.drop_duplicates(subset=["email"], keep="first", inplace=True)

person

   id             email
0   1  john@example.com
1   2   bob@example.com

# Rank scores

In [211]:
import pandas as pd

data = [[1, 3.5], [2, 3.65], [3, 4.0], [4, 3.85], [5, 4.0], [6, 3.65]]
scores = pd.DataFrame(data, columns=['id', 'score']).astype({'id':'Int64', 'score':'Float64'})

# Check if dataframe is empty
# if scores.empty: 
#     return pd.DataFrame(columns=["score", "rank"])

# ------------------------------------------- Self-done ----------------------------------------
scores.sort_values(by=["score"], ascending=False, inplace=True)
score_list = list(scores["score"])
rank = [1]
rank_count = 1
for i in range(1, len(score_list)):
    if score_list[i] != score_list[i - 1]:
        rank_count += 1
    rank.append(rank_count)
    
scores["rank"] = rank

# scores

# ------------------------------------------ Solution -----------------------------------------
scores["rank"] = scores["score"].rank(method="dense", ascending=False)

scores.sort_values(by=["score"], ascending=False, inplace=True)

# scores["rank"] = scores["rank"].astype("int64")
scores[["score", "rank"]]

   score  rank
2    4.0   1.0
4    4.0   1.0
3   3.85   2.0
1   3.65   3.0
5   3.65   3.0
0    3.5   4.0

# Rearrange products table

In [234]:
import pandas as pd

data = [[0, 95, 100, 105], [1, 70, None, 80]]
products = pd.DataFrame(data, columns=['product_id', 'store1', 'store2', 'store3']).astype({'product_id':'int64', 'store1':'object', 'store2':'object', 'store3':'object'})

# ---------------------------------------- Solution 1 ---------------------------------------------
rearranged_rows = []

for index, row in products.iterrows():
    for store_col in ["store1", "store2", "store3"]:
        if pd.notna(row[store_col]):
            rearranged_rows.append((row["product_id"], store_col, row[store_col]))

result_df = pd.DataFrame(rearranged_rows, columns=["product_id", "store", "price"])

result_df

# --------------------------------------- Solution 2 -------------------------------------------=--
pd.melt(
    products, id_vars="product_id", var_name="store", value_name="price"
).dropna()

   product_id   store  price
0           0  store1   95.0
1           0  store2  100.0
2           0  store3  105.0
3           1  store1   70.0
4           1  store3   80.0

# The number of rich customers

In [13]:
import pandas as pd

data = [[6, 1, 549], [8, 1, 834], [4, 2, 394], [11, 3, 657], [13, 3, 257]]
store = pd.DataFrame(data, columns=['bill_id', 'customer_id', 'amount']).astype({'bill_id':'int64', 'customer_id':'int64', 'amount':'int64'})

# -------------------------------------- Self-done -------------------------------------
store = store[(store["amount"] > 500)]

rich_customers = pd.unique(store["customer_id"])

result_df = pd.DataFrame({
    "rich_count": [len(rich_customers)]
})

# result_df

# -------------------------------------- Solution --------------------------------------
rich_customers = store[(store["amount"] > 500)]

num_rich_customers = rich_customers["customer_id"].nunique()

result_df = pd.DataFrame({
    "rich_count": [num_rich_customers]
})

result_df

   rich_count
0           2

# Immediate food delivery I

In [13]:
import pandas as pd

data = [[1, 1, '2019-08-01', '2019-08-02'], [2, 5, '2019-08-02', '2019-08-02'], [3, 1, '2019-08-11', '2019-08-11'], [4, 3, '2019-08-24', '2019-08-26'], [5, 4, '2019-08-21', '2019-08-22'], [6, 2, '2019-08-11', '2019-08-13']]
delivery = pd.DataFrame(data, columns=['delivery_id', 'customer_id', 'order_date', 'customer_pref_delivery_date']).astype({'delivery_id':'Int64', 'customer_id':'Int64', 'order_date':'datetime64[ns]', 'customer_pref_delivery_date':'datetime64[ns]'})

immediate_date_df = delivery[(delivery["order_date"] == delivery["customer_pref_delivery_date"])]

immediate_date_percentage = round(immediate_date_df.shape[0] / delivery.shape[0] * 100, 2)

result_df = pd.DataFrame({
    "immdediate_percentage": [immediate_date_percentage]
})

result_df

   immdediate_percentage
0                  33.33

# Count salary categories

In [55]:
import pandas as pd

data = [[3, 108939], [2, 12747], [8, 87709], [6, 91796]]
accounts = pd.DataFrame(data, columns=['account_id', 'income']).astype({'account_id':'Int64', 'income':'Int64'})

# -------------------------------------- Self-done ---------------------------------------
income_list = list(accounts["income"])

accounts_count = [0, 0, 0] 

for income in income_list:
    if income < 20000:
        accounts_count[0] += 1
    elif income <= 50000:
        accounts_count[1] += 1
    else:
        accounts_count[2] += 1
    
result_df = pd.DataFrame({
    "category": ["Low Salary", "Average Salary", "High Salary"],
    "accounts_count": accounts_count
})

result_df

# --------------------------------------- Solution ------------------------------------------

low_income_accounts = accounts[(accounts["income"] < 20000)].shape[0]
average_income_accounts = accounts[(accounts["income"] <= 50000) & (accounts["income"] >= 20000)].shape[0]
high_income_accounts = accounts[(accounts["income"] > 50000)].shape[0]

result_df = pd.DataFrame({
    "category": ["Low Salary", "Average Salary", "High Salary"],
    "accounts_count": [low_income_accounts, average_income_accounts, high_income_accounts]
})

# result_df

         category  accounts_count
0      Low Salary               1
1  Average Salary               0
2     High Salary               3

# Find total time spent by each employee

In [57]:
import pandas as pd

data = [['1', '2020-11-28', '4', '32'], ['1', '2020-11-28', '55', '200'], ['1', '2020-12-3', '1', '42'], ['2', '2020-11-28', '3', '33'], ['2', '2020-12-9', '47', '74']]
employees = pd.DataFrame(data, columns=['emp_id', 'event_day', 'in_time', 'out_time']).astype({'emp_id':'Int64', 'event_day':'datetime64[ns]', 'in_time':'Int64', 'out_time':'Int64'})

# ------------------------------------------ Self-done -----------------------------------------
employees_new = employees.groupby(["emp_id", "event_day"]).sum()
# Reset index after groupby 
employees_new.reset_index(inplace=True)

total_time = employees_new["out_time"] - employees_new["in_time"]

result_df = pd.DataFrame({
    "day": employees_new["event_day"],
    "emp_id": employees_new["emp_id"],
    "total_time": total_time
})

result_df

# ----------------------------------------- Solution -------------------------------------------
employees["time_spent"] = employees["out_time"] - employees["in_time"]

result_df = employees.groupby(["event_day", "emp_id"])["time_spent"].sum().reset_index()

result_df.rename(columns={
    "event_day": "day",
    "time_spent": "total_time"
}, inplace=True)

# result_df

         day  emp_id  total_time
0 2020-11-28       1         173
1 2020-12-03       1          41
2 2020-11-28       2          30
3 2020-12-09       2          27

# Game play analysis I

In [92]:
import pandas as pd

data = [[1, 2, '2016-03-01', 5], [1, 2, '2016-05-02', 6], [2, 3, '2017-06-25', 1], [3, 1, '2016-03-02', 0], [3, 4, '2018-07-03', 5]]
activity = pd.DataFrame(data, columns=['player_id', 'device_id', 'event_date', 'games_played']).astype({'player_id':'Int64', 'device_id':'Int64', 'event_date':'datetime64[ns]', 'games_played':'Int64'})

# ----------------------------------------- Self-done -----------------------------------------
result_df = activity.sort_values(["event_date"])

result_df = activity.groupby(["player_id"])["event_date"].min().reset_index()

result_df.rename(columns={
    "event_date": "first_login"
}, inplace=True)

result_df

# ----------------------------------------- Solution -----------------------------------------
# activity = activity.sort_values(["event_date", "player_id"])

# result_df = activity.groupby(["player_id"])["event_date"].min().reset_index()

# result_df.rename(columns={
#     "event_date": "first_login"
# }, inplace=True)

# result_df

   player_id first_login
0          1  2016-03-01
1          2  2017-06-25
2          3  2016-03-02

# Number of unique subjects taught by each teacher

In [99]:
import pandas as pd

data = [[1, 2, 3], [1, 2, 4], [1, 3, 3], [2, 1, 1], [2, 2, 1], [2, 3, 1], [2, 4, 1]]
teacher = pd.DataFrame(data, columns=['teacher_id', 'subject_id', 'dept_id']).astype({'teacher_id':'Int64', 'subject_id':'Int64', 'dept_id':'Int64'})

result_df = teacher.groupby(["teacher_id"])["subject_id"].nunique()

result_df = pd.DataFrame(result_df).reset_index()

result_df.rename(columns={
    "subject_id": "cnt"
}, inplace=True)

result_df

   teacher_id  cnt
0           1    2
1           2    4

# Daily leads and partners

In [107]:
import pandas as pd

data = [['2020-12-8', 'toyota', 0, 1], ['2020-12-8', 'toyota', 1, 0], ['2020-12-8', 'toyota', 1, 2], ['2020-12-7', 'toyota', 0, 2], ['2020-12-7', 'toyota', 0, 1], ['2020-12-8', 'honda', 1, 2], ['2020-12-8', 'honda', 2, 1], ['2020-12-7', 'honda', 0, 1], ['2020-12-7', 'honda', 1, 2], ['2020-12-7', 'honda', 2, 1]]
daily_sales = pd.DataFrame(data, columns=['date_id', 'make_name', 'lead_id', 'partner_id']).astype({'date_id':'datetime64[ns]', 'make_name':'object', 'lead_id':'Int64', 'partner_id':'Int64'})

# -------------------------------------------- Self-done -------------------------------------------
unique_lead_count = daily_sales.groupby(["date_id", "make_name"])["lead_id"].nunique().reset_index()
unique_partner_count = daily_sales.groupby(["date_id", "make_name"])["partner_id"].nunique().reset_index()

result_df = pd.DataFrame({
    "date_id": unique_lead_count["date_id"],
    "make_name": unique_lead_count["make_name"],
    "unique_leads": unique_lead_count["lead_id"],
    "unique_partners": unique_partner_count["partner_id"]
})

# result_df

# -------------------------------------------- Solution -------------------------------------------
result_df = daily_sales.groupby(["date_id", "make_name"]).agg({"lead_id": "nunique", "partner_id": "nunique"}).reset_index()

result_df.rename(columns={
    "lead_id": "unique_leads",
    "partner_id": "unique_partners"
}, inplace=True)

result_df

     date_id make_name  unique_leads  unique_partners
0 2020-12-07     honda             3                2
1 2020-12-07    toyota             1                2
2 2020-12-08     honda             2                2
3 2020-12-08    toyota             2                3

# Group sold products by the date

In [151]:
import pandas as pd

data = [['2020-05-30', 'Headphone'], ['2020-06-01', 'Pencil'], ['2020-06-02', 'Mask'], ['2020-05-30', 'Basketball'], ['2020-06-01', 'Bible'], ['2020-06-02', 'Mask'], ['2020-05-30', 'T-Shirt']]
activities = pd.DataFrame(data, columns=['sell_date', 'product']).astype({'sell_date':'datetime64[ns]', 'product':'object'})

result_df = activities.groupby(["sell_date"])["product"].agg(["nunique", lambda x: ",".join(sorted(set(x)))]).reset_index()

result_df.rename(columns={
    "nunique": "num_sold",
    "<lambda_0>": "products"
}, inplace=True)

result_df

   sell_date  num_sold                      products
0 2020-05-30         3  Basketball,Headphone,T-Shirt
1 2020-06-01         2                  Bible,Pencil
2 2020-06-02         1                          Mask

# Customer placing the largest number of orders

In [190]:
import pandas as pd

data = [[1, 1], [2, 2], [3, 3], [4, 3], [5, 1]]
orders = pd.DataFrame(data, columns=['order_number', 'customer_number']).astype({'order_number':'Int64', 'customer_number':'Int64'})

count_order = orders.groupby(["customer_number"])["order_number"].count().reset_index()

max_order_customer = count_order[(count_order["order_number"] == count_order["order_number"].max())]

max_order_customer[["customer_number"]]

   customer_number
0                1
2                3

# Classes more than 5 students

In [215]:
import pandas as pd

data = [['A', 'Math'], ['B', 'English'], ['C', 'Math'], ['D', 'Biology'], ['E', 'Math'], ['F', 'Computer'], ['G', 'Math'], ['H', 'Math'], ['I', 'Math']]
courses = pd.DataFrame(data, columns=['student', 'class']).astype({'student':'object', 'class':'object'})

student_count = courses.groupby(["class"])["student"].count().reset_index()

result_df = student_count[(student_count["student"] >= 5)]

result_df[["class"]]

  class
3  Math

# Actors and directors who cooperated at least three times

In [227]:
import pandas as pd

data = [[1, 1, 0], [1, 1, 1], [1, 1, 2], [1, 2, 3], [1, 2, 4], [2, 1, 5], [2, 1, 6]]
actor_director = pd.DataFrame(data, columns=['actor_id', 'director_id', 'timestamp']).astype({'actor_id':'int64', 'director_id':'int64', 'timestamp':'int64'})

# ---------------------------------------- Self-done -------------------------------------------
result_df = actor_director.groupby(["actor_id", "director_id"]).count().reset_index()

# result_df[(result_df["timestamp"] >= 3)][["actor_id", "director_id"]]

# ---------------------------------------- Solution --------------------------------------------
result_df = actor_director.groupby(["actor_id", "director_id"]).size().reset_index(name="count_coop")

result_df[(result_df["count_coop"] >= 3)][["actor_id", "director_id"]]

   actor_id  director_id
0         1            1

# Sales person

In [18]:
import pandas as pd

data = [[1, 'John', 100000, 6, '4/1/2006'], [2, 'Amy', 12000, 5, '5/1/2010'], [3, 'Mark', 65000, 12, '12/25/2008'], [4, 'Pam', 25000, 25, '1/1/2005'], [5, 'Alex', 5000, 10, '2/3/2007']]
sales_person = pd.DataFrame(data, columns=['sales_id', 'name', 'salary', 'commission_rate', 'hire_date']).astype({'sales_id':'Int64', 'name':'object', 'salary':'Int64', 'commission_rate':'Int64', 'hire_date':'datetime64[ns]'})
data = [[1, 'RED', 'Boston'], [2, 'ORANGE', 'New York'], [3, 'YELLOW', 'Boston'], [4, 'GREEN', 'Austin']]
company = pd.DataFrame(data, columns=['com_id', 'name', 'city']).astype({'com_id':'Int64', 'name':'object', 'city':'object'})
data = [[1, '1/1/2014', 3, 4, 10000], [2, '2/1/2014', 4, 5, 5000], [3, '3/1/2014', 1, 1, 50000], [4, '4/1/2014', 1, 4, 25000], [5, '4/1/2014', 4, 5, 25000]]
orders = pd.DataFrame(data, columns=['order_id', 'order_date', 'com_id', 'sales_id', 'amount']).astype({'order_id':'Int64', 'order_date':'datetime64[ns]', 'com_id':'Int64', 'sales_id':'Int64', 'amount':'Int64'})

# ------------------------------------ Solution + Self-done -----------------------------------------
merge_df = sales_person.merge(orders, on="sales_id", how="left").merge(company, on="com_id", how="left", suffixes=("_employee", "_company"))

sales_other_company = merge_df[(merge_df["name_company"] != "RED") | (merge_df["name_company"].isna())]

sales_red_company = merge_df[(merge_df["name_company"] == "RED")]

result_df = sales_other_company[~(sales_other_company["sales_id"].isin(sales_red_company["sales_id"]))][["name_employee"]]

result_df.rename(columns={
    "name_employee": "name"
}, inplace=True)

result_df = result_df.drop_duplicates(subset=["name"])

result_df

   name
1   Amy
2  Mark
5  Alex

# Replace employee ID with the unique identifier

In [34]:
import pandas as pd

data = [[1, 'Alice'], [7, 'Bob'], [11, 'Meir'], [90, 'Winston'], [3, 'Jonathan']]
employees = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'int64', 'name':'object'})
data = [[3, 1], [11, 2], [90, 3]]
employee_uni = pd.DataFrame(data, columns=['id', 'unique_id']).astype({'id':'int64', 'unique_id':'int64'})

# --------------------------------------- Self-done ------------------------------------------
merge_df = employee_uni.merge(employees, on="id", how="right")

merge_df["unique_id"] = merge_df["unique_id"].astype("Int64")

# merge_df

# --------------------------------------- Solution -------------------------------------------
merge_df = employees.merge(employee_uni, on="id", how="left")

merge_df["unique_id"] = merge_df["unique_id"].astype("Int64")

merge_df[["unique_id", "name"]]

   unique_id      name
0       <NA>     Alice
1       <NA>       Bob
2          2      Meir
3          3   Winston
4          1  Jonathan

# Students and examinations

In [3]:
import pandas as pd

data = [[1, 'Alice'], [2, 'Bob'], [13, 'John'], [6, 'Alex']]
students = pd.DataFrame(data, columns=['student_id', 'student_name']).astype({'student_id':'Int64', 'student_name':'object'})
data = [['Math'], ['Physics'], ['Programming']]
subjects = pd.DataFrame(data, columns=['subject_name']).astype({'subject_name':'object'})
data = [[1, 'Math'], [1, 'Physics'], [1, 'Programming'], [2, 'Programming'], [1, 'Physics'], [1, 'Math'], [13, 'Math'], [13, 'Programming'], [13, 'Physics'], [2, 'Math'], [1, 'Math']]
examinations = pd.DataFrame(data, columns=['student_id', 'subject_name']).astype({'student_id':'Int64', 'subject_name':'object'})

# -------------------------------------- Solution ----------------------------------------------
df1 = students.merge(subjects, how="cross")

df2 = examinations.groupby(["student_id", "subject_name"]).agg(
    attended_exams = ("subject_name", "count")
).reset_index()

result_df = df1.merge(df2, on=["student_id", "subject_name"], how="left").sort_values(by=["student_id", "subject_name"])

result_df.fillna(0)[["student_id", "student_name", "subject_name", "attended_exams"]]

    student_id student_name subject_name  attended_exams
0            1        Alice         Math             3.0
1            1        Alice      Physics             2.0
2            1        Alice  Programming             1.0
3            2          Bob         Math             1.0
4            2          Bob      Physics             0.0
5            2          Bob  Programming             1.0
9            6         Alex         Math             0.0
10           6         Alex      Physics             0.0
11           6         Alex  Programming             0.0
6           13         John         Math             1.0
7           13         John      Physics             1.0
8           13         John  Programming             1.0

# Managers with at least 5 direct reports

In [1]:
import pandas as pd

data = [[101, 'John', 'A', None], [102, 'Dan', 'A', 101], [103, 'James', 'A', 101], [104, 'Amy', 'A', 101], [105, 'Anne', 'A', 101], [106, 'Ron', 'B', 101]]
employee = pd.DataFrame(data, columns=['id', 'name', 'department', 'managerId']).astype({'id':'Int64', 'name':'object', 'department':'object', 'managerId':'Int64'})

# ---------------------------------------------------------------------------------------
filtered_df = employee.groupby(["managerId"]).agg(
    reports = ("managerId", "count")
).reset_index()

result_df = employee.merge(filtered_df, left_on="id", right_on="managerId", how="left")

result_df["reports"] = result_df["reports"].fillna(0)

result_df = result_df[(result_df["reports"] >= 5)]

result_df[["name"]]

   name
0  John